lenght1 = float(input("Введите длину 1ого параллелепипеда" ))
width1 = float(input("Введите ширину 1ого параллелепипеда" ))
height1 = float(input("Введите высоту 1ого параллелепипеда" ))
lenght2 = float(input("Введите длину 2ого параллелепипеда" ))
width2 = float(input("Введите ширину 2ого параллелепипеда" ))
height2 = float(input("Введите высоту 2ого параллелепипеда" ))
lenght3 = float(input("Введите длину 3его параллелепипеда" ))
width3 = float(input("Введите ширину 3его параллелепипеда" ))
height3 = float(input("Введите высоту 3его параллелепипеда" )) #Ввели переменные для каждого параллелепипеда (длину, ширину и высоту)
volme1 = lenght1 * width1 * height1 #нашли объём первого
volme2 = lenght2 * width2 * height2 #нашли объём второго
volme3 = lenght3 * width3 * height3 #нашли объём третьего
m = volme1 + volme2 + volme3 #нашли общий объём сложив j, k и l
print(m) #и выыели результатик))