a = float(input("Введите длину 1ого параллелепипеда" ))
b = float(input("Введите ширину 1ого параллелепипеда" ))
c = float(input("Введите высоту 1ого параллелепипеда" ))
d = float(input("Введите длину 2ого параллелепипеда" ))
e = float(input("Введите ширину 2ого параллелепипеда" ))
f = float(input("Введите высоту 2ого параллелепипеда" ))
g = float(input("Введите длину 3его параллелепипеда" ))
h = float(input("Введите ширину 3его параллелепипеда" ))
i = float(input("Введите высоту 3его параллелепипеда" )) #Ввели переменные для каждого параллелепипеда (длину, ширину и высоту)
j = a * b * c #нашли объём первого
k = d * e * f #нашли объём второго
l = g * h * i #нашли объём третьего
m = j + k + l #нашли общий объём сложив j, k и l
print(m) #и выыели результатик))